Tekla Open API Reference for Tekla Structures 2025
Brep Constructor (Point, Point)
 Initializes a new instance of the Brep class with the given start and end points.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Brep(
	Point startPoint,
	Point endPoint
)
Public Sub New (
	startPoint As Point,
	endPoint As Point
)
Parameters
startPoint
Type: Tekla.Structures.Geometry3d.Point
The start point for the brep.
endPoint
Type: Tekla.Structures.Geometry3d.Point
The end point for the brep.
See Also
Reference
Brep Class
Brep Overload
Tekla.Structures.Model Namespace